{
  "id": "core-features",
  "themeColor": "pink",
  "component": [
    {
      "type": "navbar",
      "list": [
        {
          "type": "left",
          "icoIos": "icon icon-back",
          "icoMat": "icon icon-back",
          "class": "back link",
          "click": "#"
        },
        {
          "type": "title",
          "text": "Content Block & Title"
        }
      ]
    },
    {
      "type": "title",
      "shape": "sign",
      "text": "Ultra Easy To Use",
      "right": "more...",
      "click": "#"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "To create iOS or Android apps using AppBe is so easy as website creation. Try to start and you will be surprised how easy is it. All you need to make it work is a simple HTML layout and attached framework's CSS and JS files! AppBe doesn't force you to write some custom tags that will be converted by JavaScript to something else. It doesn't force you to write and describe all your content in JavaScript (or JSON). Just plain HTML and you always get exactly the same that you expect to get when you write this HTML."
        }
      ]
    },
    {
      "type": "title",
      "shape": "pillar",
      "fill": "1",
      "text": "Native Scrolling"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "It can sound even curious but one of the most important AppBe feature is that it uses only native scrolling. Moreover - it multiplies its advantages! So you can still have this awesome scrolling with momentum and resistance bounce without any scrolling issues!"
        }
      ]
    },
    {
      "type": "title",
      "shape": "pod",
      "fill": "1",
      "text": "Library Agnostic"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "AppBe doesn't use and does not depend on any third party libraries. That is why it is ultra lightweight, performance and flexible."
        }
      ]
    },
    {
      "type": "title",
      "shape": "pillar",
      "fill": "0",
      "text": "Custom DOM Library"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "AppBe doesn't use any third party library, even for DOM operation, even jQuery. It has its own custom DOM library that utilizes most edge and high-performance methods for DOM manipulation. You can also use it and you don't need to learn something new for that, it has the same syntax as well known jQuery library with support of the most popular and widely used methods and jQuery-like chaining."
        }
      ]
    },
    {
      "type": "title",
      "shape": "pillar",
      "align": "right",
      "fill": "0",
      "text": "XHR + Caching + History + Preloading"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "his is an unbeatable combination to make your app routing as perfect as possible. AppBe is ready to route your app pages using XHR (optional) with its own internal methods and internal HTML configurable caching that allow to load pages faster and save a lot of time and traffic for your users! It loads page via Ajax only ones per specified caching period (10 minutes by default), other times it just gets it from memory. It allows to make further requests immediately!"
        }
      ]
    },
    {
      "type": "title",
      "shape": "pod",
      "align": "center",
      "fill": "0",
      "text": "High-performance Animations"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "It is all about performance and AppBe uses only high performance hardware accelerated css animations and transitions to achieve the best result."
        }
      ]
    },
    {
      "type": "title",
      "shape": "pod",
      "align": "right",
      "fill": "0",
      "text": "Easy To Customize"
    },
    {
      "type": "content",
      "list": [
        {
          "text": "With AppBe everything is simple, all styles are divided by parts into small .less files, so you can really easy bring your own custom styles to your app"
        }
      ]
    }
  ]
}